[
    {
        "name": "Ahtziry Vasquez",
        "collection": "Orgullo",
        "bio": "Ahtziry Vazquez was born and raised in San Jose, California and will be the first in her family to graduate from college. She is currently working towards a B.A. in Design with an emphasis in fashion and textiles, and a minor in Chicano Studies at the University of California, Davis. Ahtziry serves at the board for the Fashion and Design Society as Treasurer and has assisted in the organization of the Intertwine Fashion Show 2023. She was also a fashion marketing intern for Avalon Apparel where she helped with trend forecasting and remotely contributed to the research of the design team. She has developed her skills in draping, sewing, and pattern making through her years at UC Davis. She has explored surface design and digital prints and has been experimenting with different dyeing methods to create her own fabric swatch collections. In addition, she is self-taught in traditional illustrations and has recently delved into making digital illustrations related to fashion and other subjects. Ahtziry aspires to continue to explore textiles and work within fashion to enhance her technical skills while integrating her cultural emphasis in her designs even further.",
        "statement": "“Orgullo'' (translation: proud) aims to be a powerful representation of Mexican culture. Inspired by Chicano murals and through my learning of what it is to be a Mexican American in the United States, I created a loud collection that reflects our presence. With the use of my textile skills, I designed symbolic patterns to convey hardships and prosperity and digitally printed them on my fabrics. The complexity of Mexican culture influenced the fabric manipulations in each of my looks, from tucks and smocking to gatherings. My collection values the richfulness that my people carry even when it is often overlooked. The bold colors of blues and greens remind -of the vividness of Mexican culture while the black and tan colors call upon our struggles.",
        "headshot": "/media/2023fsheadshot/2023ahtziryheadshot.png",
        "moodboard": "/media/2023fsmoodboard/2023ahtzirymoodboard.jpg",
        "contact": "ahtvazquez@ucdavis.edu"
    },
    {
        "name": "Alyssa-Mae Basa",
        "collection": "Taijitu",
        "bio": "Alyssa-Mae Basa is a student completing a BA in Design at UC Davis. She graduated from Los Angeles City College with an Associate's Degree in Business Administration as well as Social and Behavioral Sciences. Alyssa first gained experience in fashion design through her five-look collection, Green, created in her senior year of high school and a year long internship for the Jackie B Showroom in Downtown Los Angeles. Her design practice centers on the relationship between aesthetic and comfortability with intentions that lie within the preservation of confidence. Alyssa aims to further her contribution in the fashion industry through inclusive fashion that celebrates unconventional beauty deserving of recognition.",
        "statement": "Taijitu, more commonly referred to as yin and yang, motivated my exploration into the relationships between opposing elements and how they interwork to create seamless designs. I resonate with many of the things yin and yang represent, like duality, balance, and the known vs the unknown. The concept of duality drove my decisions in fabric choice, the color palette, as well as my fabric manipulation methods. I tried to find balance in asymmetry and the proportions of each of the three looks. Lastly, the known vs, the unknown signifies my progression as a designer, while using the best of my abilities, I allow myself room for experimentation. As a reminder to be true to myself while discovering the design field, my collection, Taijitu, embodies the values I align with as a creator.",
        "headshot": "/media/2023fsheadshot/2023alyssaheadshot.png",
        "moodboard": "/media/2023fsmoodboard/2023alyssamoodboard.jpg",
        "contact": "asbasa@ucdavis.edu"
    },
    {
        "name": "Candice Mitra",
        "collection": "Luckiest Charms",
        "bio": "Candice Mitra is a 4th-year design student at the University of California, Davis with a minor in Environmental Policy and Planning. Candice has an interest in fashion and graphic design, hoping to integrate sustainable design practices into their work. They currently intern as a Student Media and Publicity Assistant at the Center for Student Involvement at UC Davis, where they create graphics and other marketing material to provide information regarding registered student organizations’ events and logistics. What began as a pipe dream from the fashion fanatic becomes a reality for Candice as they break out of their comfort zone to pursue fashion design.",
        "statement": " Featuring elements reminiscent of my childhood such as teddy bears and friendship bracelets, Luckiest Charms symbolizes my inner child that is able to be expressed through fashion and design. A longing for the escape and pure enjoyment of creating art without limitations or rules. I hope to reflect this sense of the joviality of being creative through this fun and vibrant collection. Luckiest Charms upcycles childrens’ clothing and toys and includes playful accents such as beaded charm chains. I find that my collection reflects my indecision as a designer, featuring both conventional and unconventional silhouettes. It uses simple color palettes as well as more vibrant color palettes and elements. Despite the seeming chaos behind this collection, it all ties together into a singular collection, Luckiest Charms.",
        "headshot": "/media/2023fsheadshot/2023candiceheadshot.jpg",
        "moodboard": "/media/2023fsmoodboard/2023candicemoodboard.png",
        "contact": "clmitra@ucdavis.edu"
    },
    {
        "name": "Deirdre Spillane-Jimenez",
        "collection": "Natewa",
        "bio": "Deirdre Spillane-Jimenez is a designer and artist from Northern California, currently working towards a Design B.A. at UC Davis. Having begun sewing clothes at a young age and with a lifelong love for fashion, Deirdre has continued to grow her repertoire of skills in pattern making, garment construction and dyeing textiles. Interning at 39+ Manifatture in Milan, she has assisted in client based pattern making and prototype fitting. She is interested in creating elevated casualwear and is greatly inspired by the natural world.",
        "statement": "Natewa is an ode to the coral reefs of Natewa Bay, located on the Eastern Peninsula on the Fijian Island of Vanua Levu. Inspired by a week of biological surveys on a conservation research expedition and fueled by the inherent warmth of Fijian culture, this collection aims to capture the vivid and graceful natural forms of the reef. The long trailing ribbons are to give the illusion of underwater movement and how one floats over the coral. Triangular forms in the collection are in reference to the Black Tipped Reef Shark, and with prints which reference the Fijian Blue Spotted Stingray.",
        "headshot": "/media/2023fsheadshot/2023deirdreheadshot.png",
        "moodboard": "/media/2023fsmoodboard/2023deidremoodboard.JPG",
        "contact": "dspillanejimenez@ucdavis.edu"
    },
    {
        "name": "Heather Lee",
        "collection": "Apothecary Patchwork",
        "bio": "Heather Lee is a multimedia artist who now resides in the Sacramento area after having grown up in the U.K. She has always created art, and enjoys a variety of mediums, whatever works for her mood and style. Her passion is creating textile art, and she began in fiber arts at age 8 with embroidery. Pagan, fantasy and nature themes are often in her work. She has a small successful side business called Autumn Lee Creations. She creates small handmade items and sells them at conventions, as well as designing one off clothing for costuming and more. Heather completed an AA in Art in the summer of 2021, and will complete her BA at UC Davis in Design in June of 2023. Her art has been shown several places, including Through the Lens at the SMUD gallery, the ARC Student show in the Crocker Art Museum, Elk Grove Multicultural show, and Pink week at Artspace 1616.",
        "statement": "I design bespoke slow fashion, one of a kind items that will last well past normal fast fashion. I also strive to reduce fashion waste, using as much deadstock, leftover and upcycled fabric to create new fabrics, often using patchwork and other techniques. I have been creating quilts for over 25 years, using fabric scraps to create new beautiful art pieces. My signature collection, Apothecary Patchwork, is a merging of my love of patchwork and the steampunk aesthetic. Over 90% of this collection uses repurposed materials to create one of a kind pieces that can be worn as a full steampunk outfit, or individually to create your own look.",
        "headshot": "/media/2023fsheadshot/2023heatherheadshot.jpg",
        "moodboard": "/media/2023fsmoodboard/2023heathermoodboard.jpg",
        "contact": "healee@ucdavis.edu"
    },
    {
        "name": "Jareth Ryford",
        "collection": "Imperfectionism",
        "bio": "Jareth Damien-Danger Ryford is a student designer from Sacramento, California currently studying Design at UC Davis. He got his start designing costumes and props for friends and family while in community college and follows that same passion for theatrics in his work today. Ryford’s work is inspired by punk and metal music, cult films, and tabletop gaming. He believes that clothing should put the ‘fun’ in ‘functional’, and, when in doubt, he goes with whatever seems like a better time. As a trans guy, he sees it as his duty to create one-of-a-kind clothes for all body types, in an attempt to prove that ‘androgynous’ fashion doesn’t have to be bland. He is truly honored to have had the chance to create outfits for the fashion show today and hopes to continue to make clothing that people feel good wearing.",
        "statement":"Imperfectionism is an ode to my fellow fashion design students as seen from Cruess Hall in the wee small hours of the morning. It’s a self referential study in last minute changes, snapped threads, and emptied bobbin wheels; a toast to crowded tables filled with laughter and barely contained screams. The patches and ironons are pulled directly from info laminates and “Cruess Tattoos” hidden around the building; the yarn embroidery is nod to the various notches and notes taken on our muslin mockups from our beginnings in DES 77 until here and now in DES 179 (the class who made the collections you are all seeing today); and the notions, bits, and buttons are all tools of the trade, pieces of our second skins. To be honest, Imperfectionism was something I stumbled into, not purposefully, but because Cruess Hall always has a way of changing your ideas in the most unexpected ways. This collection is dedicated to my favorite fashion insomniacs: Liza, Nick, Jorge, Elle, Deirdre, Somen, Irina, KT, and Uriel; go home and get some sleep you guys.",
        "headshot": "/media/2023fsheadshot/2023jarethheadshot.jpg",
        "moodboard": "/media/2023fsmoodboard/2023jarethmoodboard.png",
        "contact": "jdryford@ucdavis.edu"
    },
    {
        "name": "KT Nguyen",
        "collection": "Freak Show",
        "bio": "KT Nguyen is a third year art studio and design double major with an emphasis on wearable sculpture and sustainable fashion. They enjoy walking the line between fashion and art/costume. They work as a painter in a studio in downtown Davis called Clackeys that manufactures artisan keycaps, as well as a student assistant in the costume section of the UC Davis theater and dance department.",
        "statement": "My collection features a carnival theme with both whimsical and unsettling elements. The models are meant to embody the characters they present as, not actual people, paying homage to the collection's title, 'Freak Show'. Any sign of human identity is stripped away with a face, hair, and skin covering. I work with the dichotomy of circus freaks, who are meant to bring joy and pleasure, and yet are feared and seen as other at the same time.",
        "headshot": "/media/2023fsheadshot/2023ktheadshot.png",
        "moodboard": "/media/2023fsmoodboard/2023ktmoodboard.png",
        "contact": "katnguye@ucdavis.edu"
    },
    {
        "name": "Natali Camarillo",
        "collection": "Phantasmagoria",
        "bio": "Natali Camarillo is a student from Ukiah. She is currently attending University of California, Davis for her B.A. in Design. Her work includes illustration, graphic design, and garment design. Only sewing since September, she incorporates crochet and machine knit into her designs. She enjoys rendering portraits and upcycling old clothes. During her time in school she hopes to master garment construction and later incorporate her illustrative work into fashion. With graduation approaching quickly, she plans on pursuing technical design. Some of her work can be seen at instagram.com/natandornatali",
        "statement": "Phantasmagoria describes a constant dream-like state. My collection embodies this feeling through bright pink and green and calm blue and gray. Whimsical features like the fox, wispy accents, and netting embody the playfulness of dreams. While I enjoy the look of fishnets, I wanted to bring them to the surface and blow up the pattern. Another essential part of a dream-like state is comfort, found in soft and stretchy knits for the base of every outfit. The designs are inspired by hours of scanning Vivienne Westwood and Chanel books along with my own dreams.",
        "headshot": "/media/2023fsheadshot/2023nataliheadshot.jpg",
        "moodboard": "/media/2023fsmoodboard/2023natalimoodboard.png",
        "contact": "nrcamarillo@ucdavis.edu"
    },
    {
        "name": "Nick Fish",
        "collection":"Growing Pains",
        "bio": "Meet Nick Fish, a rising fashion and graphic designer hailing from Dixon, California, who is currently pursuing his Bachelor of Arts in Design at the prestigious University of California Davis. Nick's design emphasis lies at the intersection of fashion and graphic design, and he is deeply passionate about exploring their creative possibilities. Nick is an active member of the Fashion and Design Society, where he attends meetings and engages with fellow designers, pushing the boundaries of his creativity. He was also selected for the Keller Pathaway Fellowship in the school year 2021-2022, a prestigious program that helped him expand his network and hone his entrepreneurial skills through monthly lectures and meetings with his cohort. In the summer of 2022, Nick traveled to Milan, Italy, to intern at Marc Alec and gain a deeper understanding of the fashion business. This experience exposed him to new ideas, styles, and perspectives, which he now incorporates into his work. Currently, his focus surrounds perfecting his craft, finding his voice as a creator, and surrounding himself with like-minded individuals.",
        "statement": "Nick's design philosophy is centered on the concept of wabi-sabi, a Japanese aesthetic that embraces imperfection and celebrates the beauty of impermanence. He describes his work as curated, childishly mature, and organic, taking inspiration from his surroundings, including conversations, objects, people, and perspectives. Nick's debut collection, Growing Pains, is a testament to his personal growth and evolution as a designer and as a person. The collection features menswear and unisex garments, reworked fabrics, and neutral tones, all of which tell a story connected to his life experiences. Nick wants his collection to be more than just clothes; he wants to share his journey, his roots, and his personality with his audience. In summary, Nick Fish is a driven and creative designer who is passionate about fashion and graphic design. He is constantly refining his craft, seeking inspiration from his surroundings, and pushing the boundaries of what is possible. With a unique perspective and a personal touch, Nick is poised to make a mark in the world of design.",
        "headshot": "/media/2023fsheadshot/2023nickheadshot.JPG",
        "moodboard": "/media/2023fsmoodboard/2023nickmoodboard.png",
        "contact": "nkfish@ucdavis.edu"
    },
    {
        "name": "Nicole Marosek",
        "collection": "Sluggish",
        "bio": "Nicole Marosek started out her college career studying Managerial Economics at UC Davis, but later added Design to further develop her creative interests. She focuses on fashion and textile design, but has also explored other areas, such as graphic and installation design. Her main intent within the fashion industry is to encourage more ethical production and conscious consumption. Throughout college she has worked as a social media and marketing intern and currently works as an assistant in event design and decoration. She has also started her own online shop selling hand-made knit and crochet clothing.",
        "statement": "As a designer, I primarily work in women’s knitwear and my style tends to be playful, yet wearable. I incorporate sustainability into my designs by creating versatile pieces that can outlast short-lived trend cycles and minimizing textile waste. My collection, titled Sluggish, is inspired by the vibrant colors and organic shapes of sea slugs. I used various knitting techniques, like intarsia, drop stitch, and cable knitting, to emulate their patterns and textures. My color palette includes bright oranges, yellows, pinks, and purples to capture the vibrancy of sea slugs. My hope for this collection is to bring a fun and playful energy to everyday apparel.",
        "headshot": "/media/2023fsheadshot/2023nicoleheadshot.jpg",
        "moodboard": "/media/2023fsmoodboard/2023nicolemoodboard.jpg",
        "contact": "nlmarosek@ucdavis.edu"
    },
    {
        "name": "Somin Jeon",
        "collection": "Haneul",
        "bio": "Somin Jeon is a fourth-year design major with a minor in Theater at University of California Davis. Somin always wanted to pursue her career in the art field. Before she entered high school, she thought that art was only limited to drawing and painting. However, she started learning how to sew during her high school years and even became the costume designer for one of the school plays called “Flea in Her Ear.” After her highschool experience, Somin was able to recognize her passion for creating art with her hands. She self taught herself crochet and embroidery. Throughout her college years, she mastered different design softwares like Adobe Illustrator as well as textile dyeing, surface printing, draping, and pattern making. She also developed skills in clothing design, construction, and digital illustration.Follow soms_creative_room on instagram!",
        "statement": "The collection Haneul, which means sky in Korean, is inspired by the Korean traditional clothing known as hanbok. This collection aims to portray the sky at different times of the day. As a Korean American, I’ve always thought that my nationality as a Korean was an important aspect of my identity as I did not want to forget where I am from. Because I wanted to incorporate my Korean culture in the collection, I have taken some elements from the hanbok, such as the ribbons and having the jeogori — the jacket of the hanbok. The jeogori is closed by wrapping the front panel left over right. Because of this, the neckline overlaps and displays the most recognizable detail of the hanbok. In this collection, I mixed modern styles with the traditional Korean clothing, emphasizing a color palette of the sky. In order to get the colors I wanted for these outfits, I have tie dyed the fabrics with fabric reactive dye. Furthermore, in order to imitate the clouds, some of the manipulation I experimented with included pleats and boiled shibori, one of the heat manipulation techniques.",
        "headshot": "/media/2023fsheadshot/2023sominheadshot.jpg",
        "moodboard": "/media/2023fsmoodboard/2023sominmoodboard.png",
        "contact": "somjeon@ucdavis.edu"
    } ,
    {
        "name": "Uriel Reyes",
        "collection": "Affixed Blues",
        "bio": "Uriel Reyes is a designer and student from Los Angeles whose style is ever-changing and constantly evolving. He is currently in his fourth year at UC Davis and will receive a B.A. in Design this upcoming spring, making him the first in his family to graduate from college. Not knowing what career he wanted to pursue, Uriel came to UC Davis as a Sociology Major. However, upon stumbling into the Design Department, his plans changed as he fell in love with fashion design. He didn’t learn how to sew until taking the Intro to Fashion Design course, but within a few weeks, he constructed his very first garment. Throughout his time at UC Davis, Uriel has learned and acquired skills in textile design and print, pattern construction, draping, and garment construction. He will continue to learn, create, and elevate his skills and hopes to one day create couture clothing.",
        "statement": "When multiple different things are torn apart, there is beauty in how they can come together to create something new. That is exactly what my collection, titled AFFIXED BLUES, is all about. Using denim and plaid, I play with different colors, patterns, textures, and weights then combine them to create a harmonious blend. In designing a second collection, I wanted to showcase a different side of myself without compromising my bold and glamorous style. I took loose inspiration from the punk era of the 70s, primarily Vivian Westwood’s contribution to the movement. I admire their relentless fight for individual freedom and equality, so I wanted my collection to pay homage to that era.",
        "headshot": "/media/2023fsheadshot/2023urielheadshot.jpg",
        "moodboard": "/media/2023fsmoodboard/2023urielmoodboard.jpg",
        "contact": "ureyes@ucdavis.edu"
    }

]