[
    {
        "name": "Jeremy La",
        "collection": "Mushroom Child",
        "bio": "Jeremy La, originally from Sacramento, is an undergraduate student at the University of California, Davis. He is currently majoring in Design and minoring in Japanese. He is a board member for the Global Tea Club at UC Davis. He started off his college career studying neurobiology, physiology, and behavior, but switched to design after discovering an interest in fashion, thrifting, styling, and clothing. As a design major, he experimented with animation, graphic design, textile design, coding, and painting before choosing to focus on fashion design. He has only recently begun sewing and learning about fashion design, but hopes to further his knowledge and expertise during his remaining time in college as well as post-graduation. More information about Jeremy and his designs are available <a href='https://des117.space/fa2021-robison/jerla/narrative/'>here</a>.",
        "statement": "As a Chinese American, both my Chinese heritage and my upbringing in America are important aspects of my identity. When I think about my Chinese heritage, I recall engulfing the braised Chinese mushrooms and my mother in Cantonese would call me “mushroom child.” As such, my collection is titled Mushroom Child. My collection is a unisex collection that puts a unique spin on everyday casual wear. My collection reflects my identity by taking inspiration from traditional Chinese wear and merging it with modern day streetwear. For the color palette, I based it off of the philosophical concept of yin and yang. The simple color palette of solely black and white helps to seamlessly blend the eastern influence with the modern ideas.",
        "headshot": "/media/fashion-show-2022/designers/jeremy-la/jeremy-la.png",
        "moodboard": "/media/fashion-show-2022/designers/jeremy-la/moodboard.jpg",
        "contact": "&#106;&#101;&#114;&#108;&#097;&#064;&#117;&#099;&#100;&#097;&#118;&#105;&#115;&#046;&#101;&#100;&#117;"
    },
    {
        "name": "Nancy Marshall",
        "collection": "Reawaken",
        "bio": "Nancy Marshall is a textile designer from northwestern California with a B.A. in Design and minor in Archaeology from the University of California, Davis. With apassion for sustainability in the textile industry, Marshall has concentrated on textile dyeing, including natural dye techniques and repeat pattern screen printing. Combining these two fields of design, she developed an honors research project investigating methods for natural dye textile printing. Her aesthetic inspirations combine historical esoteric art with contemporary illustration and graphic styles. By combining illustration and sustainability in textile printing, Marshall hopes to nudge the fashion conscious towards a more ecologically aware future.",
        "statement": "My designs are part of a larger project emphasizing the feasibility of natural dye printing in contemporary streetwear. The work that I produce is heavily inspired by natural forms: insects, birds, plants, and soil, as well as some influence from esoteric abstract art from the turn of the 20th century. The garments I have produced are not gendered and follow streetwear and workwear silhouettes with the addition of some reworked basics enhanced by intriguing surface print designs. Reawaken evokes curiosity and mysterious pasts by drawing the eye in to bold prints on unapologetic garments that demand attention while holding a gentle secret of their natural dye.",
        "headshot": "/media/fashion-show-2022/designers/nancy-marshall/nancy-marshall.png",
        "moodboard": "/media/fashion-show-2022/designers/nancy-marshall/moodboard.jpg",
        "contact": "&#110;&#106;&#109;&#097;&#114;&#115;&#104;&#097;&#108;&#108;&#064;&#117;&#099;&#100;&#097;&#118;&#105;&#115;&#046;&#101;&#100;&#117;"
    },
    {
        "name": "Lauren-Nicole Dorsey",
        "collection": "Threshold",
        "bio": "Lauren-Nicole Dorsey is a fourth-year design major, working towards a BA in Fashion Design with a minor in Italian at UC Davis. Throughout her high school and college careers, she has worked and interned for clothing brands such as Half Pints Moda children’s clothing brand and women’s loungewear brand Everyday Ritual, to sharpen her skills in fashion design, merchandising, and business. She often spends her free time upcycling thrift store clothing and working on fashion illustrations. Her style and general design aesthetic surrounds women’s street and sportswear. She is interested in taking classic silhouettes and changing some elements to create new looks. Lauren also promotes and supports African American inclusivity in the fashion industry.",
        "statement": "Threshold by Lauren-Nicole is inspired by experimental and uniquely geometric shaped architecture to create a collection of three women’s sportswear looks. I was drawn to the visual pleasure of walking into buildings that appeared completely different on the outside than they did on the inside, and I wanted to incorporate this idea through each of my looks. Transformation is a very intentional part of this collection. My color palette is an experimentation of warm and cool tones, using midnight blues, ivory and egg whites and a vibrant eye-catching orange for a beautiful contrast. My collection emulates structure and power, to represent these unique structures.",
        "headshot": "/media/fashion-show-2022/designers/lauren-nicole-dorsey/lauren-nicole-dorsey.png",
        "moodboard": "/media/fashion-show-2022/designers/lauren-nicole-dorsey/moodboard.jpg",
        "contact": "&#076;&#114;&#100;&#111;&#114;&#115;&#101;&#121;&#064;&#117;&#099;&#100;&#097;&#118;&#105;&#115;&#046;&#101;&#100;&#117;"
    },
    {
        "name": "Izzy Goldschneider",
        "collection": "Desert Skies",
        "bio": "Isadora Goldschneider is an artist from Nevada City, CA whose style is influenced by her love of nature and relationship to music. She currently studies Design at UC Davis with a focus on textiles, exploring clothing construction and surface design as an exciting means for repurposing second hand and local materials, finding alternatives to destructive unfettered consumerism. Her very tactile experience as a textile artist and musician pushes creative boundaries, exploring the imperfection that is inherent in the human experience. The theme of rhythm in art, irregularity in design and a physicality of processes is what drives her love of textiles.",
        "statement": "The high desert in northwestern Nevada inspires my Desert Skies signature collection, as I draw from my love of the desert, vintage clothing, natural fibers, and textile exploration. Applying fiber art techniques, I adhere local merino wool to silk and delve into dyeing hemp, linen, and cotton with indigo. My interest in using raw and secondhand materials has led me to this exploration of designing a comfortable collection of casual wear with a playful palette, 80’s silhouettes and a textural experience. Through scouring, dyeing, and felting materials I recreate my experience of connecting to nature in The Black Rock Desert, where the sky is ever changing, where conditions are harsh and textures are rough, yet the most delicate flowers bloom.",
        "headshot": "/media/fashion-show-2022/designers/isadora-goldschneider/isadora-goldschneider.png",
        "moodboard": "/media/fashion-show-2022/designers/isadora-goldschneider/moodboard.jpg",
        "contact": "&#105;&#103;&#111;&#108;&#100;&#115;&#099;&#104;&#110;&#101;&#105;&#100;&#101;&#114;&#064;&#117;&#099;&#100;&#097;&#118;&#105;&#115;&#046;&#101;&#100;&#117;"
    },
    {
        "name": "Maya Tirumurti",
        "collection": "stale interiors",
        "bio": "I’ve been collecting things ever since I was small: first it was glue caps from the playground tanbark, then seashells, and then ticket stubs and photographs and voice memos in an attempt to salvage what is left of memories that I can’t quite trust to have occurred. Eventually this became my art practice; an unrelenting effort to collect evidence of the past. My work tends to be an abstracted, self-reflective byproduct of whichever thoughts are occurring at the time. This collection is based around the idea of how things we once reached toward for a sense of familiarity and comfort can grow stale over time. I wanted to explore deforming the human body through clothing as a metaphor for the deformation of memory and this was achieved by padding and draping the dress form to create bulbous sculptural garments. All pieces in this collection were sewn from my parents' old curtains.",
        "statement": "I’ve been collecting things ever since I was small: first it was glue caps from the playground tanbark, then seashells, and then ticket stubs and photographs and voice memos in an attempt to salvage what is left of memories that I can’t quite trust to have occurred. Eventually this became my art practice; an unrelenting effort to collect evidence of the past. My work tends to be an abstracted, self-reflective byproduct of whichever thoughts are occurring at the time. This collection is based around the idea of how things we once reached toward for a sense of familiarity and comfort can grow stale over time. I wanted to explore deforming the human body through clothing as a metaphor for the deformation of memory and this was achieved by padding and draping the dress form to create bulbous sculptural garments. All pieces in this collection were sewn from my parents' old curtains.",
        "headshot": "/media/fashion-show-2022/designers/maya-tirumurti/maya-tirumurti.png",
        "moodboard": "/media/fashion-show-2022/designers/maya-tirumurti/moodboard.jpg",
        "contact": "&#109;&#099;&#116;&#105;&#114;&#117;&#109;&#117;&#114;&#116;&#105;&#064;&#117;&#099;&#100;&#097;&#118;&#105;&#115;&#046;&#101;&#100;&#117;"
    },
    {
        "name": "Feier Shen",
        "collection": "Corrosion",
        "bio": "Feier Shen is a designer and student who believes in effortless and timeless styles. Currently studying design at the University of California, Davis, she creates narratives in any medium she works with, whether traditional or digitally. Her textile work is included in the 25 Million Stitches catalog, a project that raises awareness of the global refugee crisis. As a member of Arts Benicia, she actively participates in exhibitions and supports the art community. Besides traditional art, she also teaches digital painting in Photoshop, Procreate, and other painting software for children and teenagers who want to pick up the skill or advance their abilities. In the future, she hopes to intrigue and inspire others through her arts and career.",
        "statement": "There is a tipping point where all that’s known as beautiful to us might corrode away. My collection, titled Corrosion, refers to the damage caused by ocean acidification. With the ocean as the medium, I incorporated blue as the  primary color with some pinks and yellows, inspired by the rich underwater ecosystem. The holes are symbols of corrosion (or can be interpreted as bubbles) while the long strings of surface embellishments mimic corals and fish scales. To minimize waste, the cuts of the patterns are mostly simple geometric shapes and any scrap fabric is used to make embellishments. This construction reflects my perception of nature—simple yet effortless and ingenious. My goal is to not only portray beauty but also show warning signs from nature. Perhaps, our shared instinctive love for nature is the hope for us to come together and take action.",
        "headshot": "/media/fashion-show-2022/designers/feier-shen/feier-shen.png",
        "moodboard": "/media/fashion-show-2022/designers/feier-shen/moodboard.jpg",
        "contact": "&#102;&#101;&#105;&#115;&#104;&#101;&#110;&#064;&#117;&#099;&#100;&#097;&#118;&#105;&#115;&#046;&#101;&#100;&#117;"
    },
    {
        "name": "Uriel Reyes",
        "collection": "VIVIDITY",
        "bio": "Uriel Reyes is a designer and student from Los Angeles whose style draws upon the richness of the Earth. He is currently attending the University of California Davis, working towards a B.A. in Design. Not knowing what career he wanted to pursue, Uriel came to UC Davis as a Sociology Major, but upon stumbling into the Design Department his plans changed. Although his mom is an avid seamstress, he did not know how to sew until taking the Intro to Fashion Design course, and within a few weeks, he constructed his first garment. Throughout his time at UC Davis, Uriel has been able to learn and acquire skills in textile design and print, pattern construction, navigating the PAD System, draping, and garment construction. He will continue to learn, create, and elevate his skills and hopes to one day create couture clothing.",
        "statement": "As a designer, I mainly work with and design womenswear that brings forth my bold, glamorous, and campy style. I typically like to design fitted garments that showcase and embrace the woman figure, and this collection is just that. My collection, entitled “Vividity,” is a modern take on Grecian-inspired clothing. I wanted to take its flowy, draped elements and incorporated them with more structured and fitted pieces. I was also inspired by different vibrant cities around the world. From San Francisco (USA) to Longyearbyen (Norway) to Willemstad (Curaçao) to Manarola (Italy), and many more, these cities have something in common. They have buildings and homes that provide a splash of vividness to their respective countries and the world. In addition, I wanted to incorporate metalwork to bring a little edge to my collection while showcasing how items with a different purpose can be utilized to provide a unique element to my collection. My collection captures the essence of a colorful world and it instills light and happiness in fun, elegant, and couture garments.",
        "headshot": "/media/fashion-show-2022/designers/uriel-reyes/uriel-reyes.png",
        "moodboard": "/media/fashion-show-2022/designers/uriel-reyes/moodboard.jpg",
        "contact": "&#117;&#114;&#101;&#121;&#101;&#115;&#064;&#117;&#099;&#100;&#097;&#118;&#105;&#115;&#046;&#101;&#100;&#117;"
    },
    {
        "name": "Sophia Park",
        "collection": "Garden of Eden",
        "bio": "Sophia Park is a Korean American designer who draws inspiration from the narratives around her. Having grown up in both China and the United States, her design aesthetic intertwines multicultural experiences with storytelling. She is currently pursuing her bachelors degree in both Design and Economics. Park has interned at the Design Careers Club as well as Jeannie’s Alterations and Design Studio. These internships have expanded her skill set to include customer relations, precision in detailing, and a deeper understanding of fine craftsmanship. Additionally, her work as the UC Davis Design Sewing Lab Assistant has equipped her to work with industrial sewing machinery. Park is passionate about potentially pursuing menswear or luxury fashion. She hopes to one day start her own label, supporting NGOs around the globe. She desires to help people find a skill set to be self-sustained. If you would like to contact her, please email her at sohpark@ucdavis.edu. Check out her portfolio here: https:// sohpark.editorx.io/my-site",
        "statement": "“The Garden of Eden” is a vibrant and joyous interpretation of the origin of humanity. The collection draws inspiration from Genesis 2:15-17 in which, “The Lord God took the man and put him in the garden of Eden to work it and keep it. And the Lord God commanded the man, saying, ‘You may surely eat of every tree in the garden, but of the tree of knowledge of good and evil you shall not eat, for in the day that you eat of it you shall surely die’”. Park’s collection follows the storyline of perfect peace turned into irrevocable chaos through the original sin of man. The first look utilizes embroidery to mirror the perfection of the Garden of Eden. The cording in the second look represents the caveat in the perfection — the option for rebellion. Finally, the last look uses structure and wiring to encapsulate the chaos after Adam and Eve sinned. She hopes the collection takes you through the emotion of the storyline.",
        "headshot": "/media/fashion-show-2022/designers/sophia-park/sophia-park.png",
        "moodboard": "/media/fashion-show-2022/designers/sophia-park/moodboard.png",
        "contact": "&#115;&#111;&#104;&#112;&#097;&#114;&#107;&#064;&#117;&#099;&#100;&#097;&#118;&#105;&#115;&#046;&#101;&#100;&#117;"
    },
    {
        "name": "Tenzin Youedon",
        "collection":"RANGZEN",
        "bio": "Tenzin Youedon is a student and a new designer from the Bay Area whose style is archival, bold, and casual gothic grunge. She currently attends the University of California Davis and is in  her last year. She is working towards two B.A.’s in Political Science and Design. Although she began designing clothing in early 2022, she has been working consistently to build her technical skills. She owns her own small business, Free Tibet Vintage, selling vintage clothing to develop her personal style and contribute to circular fashion. She hopes to create her own clothing line while increasing Tibetan representation in the fashion industry.",
        "statement": "As a new designer, I am mainly focusing on casual androgynous wear. My motivation to pursue a future in fashion was to observe how beautiful traditional Tibetan clothing is and to share A bit of my culture with the world. I love the details within Tibetan fashion that make it unique. Unfortunately, I haven’t seen its influence on the streets. My work offers a unique perspective. My collection titled Rangzen warriors tells us about my heritage and the Tibetan escape from Chinese occupation. The looks incorporate inspiration from images and stories I have heard from my grandmother and many other Tibetans about their long hike in the Himalayas. It depicts Tibet’s long protest for freedom. The looks also include many elements from Tibetan Buddhism. The long sleeved shirt includes a custom made print of the faces of every Tibetan that has lit themselves on fire in protest for Tibet. The cargo pants were made out of a shower curtain I thrifted. Every piece within this collection holds significant weight. My collection captures the feelings of beauty, pain, and modesty.<br><br>Acknowledgements go out to my sponsors the Tibetan Association of Northern California and Chaksam-pa Tibetan Dance Company for their kindness in loaning me the jewelry, yak mask, and Tibetan boots.",
        "headshot": "/media/fashion-show-2022/designers/tenzin-youedon/tenzin-youedon.png",
        "moodboard": "/media/fashion-show-2022/designers/tenzin-youedon/moodboard.jpg",
        "contact": "&#116;&#121;&#111;&#117;&#101;&#100;&#111;&#110;&#064;&#117;&#099;&#100;&#097;&#118;&#105;&#115;&#046;&#101;&#100;&#117;"
    },
    {
        "name": "Savannah Risenmay",
        "collection": "Metanoia",
        "bio": "Savannah Risenmay is an aspiring fashion designer and experienced artist from Portland, Oregon. Currently a student at the University of California at Davis, she is pursuing her B.A. in Design with a focus in fashion. She interned as an Assistant Designer for Marta Dolska Design in Denmark, where she assisted with the design process including illustrations, flats, concept development and fabric sourcing. Savannah also held the position of Secretary of Public Relations in the Fashion Club at American River College, a student organization whose mission is to promote student designers to showcase new talent and further awareness of local and global fashion trends. Savannah studied as a child at the Masters School of Art in Happy Valley, Oregon for 10 years, honing and developing fine arts skills in painting and drawing in various mediums. She continues to incorporate her love of art and passion for beauty in her designs.",
        "statement": "As a designer, my aesthetic is elegant and feminine, and I primarily design women’s wear. I gravitate towards soft fabrics and light colors while my silhouettes are romantic and ethereal. My collection, titled Metanoia, is inspired by metamorphosis and the journey of personal growth. Butterflies are a symbol for growth and positive change, and I used them throughout my collection to capture the essence of this transformation. I created butterflies by hand with silk and organza, and used structural elements of corsetry in my gowns. Being heavily inspired by fantasy, I also wanted to create dresses that are beyond secular; something you might expect to be worn by fairies and nymphs.",
        "headshot": "/media/fashion-show-2022/designers/savannah-risenmay/savannah-risenmay.png",
        "moodboard": "/media/fashion-show-2022/designers/savannah-risenmay/moodboard.jpg",
        "contact": "&#115;&#108;&#114;&#105;&#115;&#101;&#110;&#109;&#097;&#121;&#064;&#117;&#099;&#100;&#097;&#118;&#105;&#115;&#046;&#101;&#100;&#117;"
    }
]